Merge pull request #16 from doughatcher/add-blog-section-v2
Stop prod build crash + trigger Micro.blog on blog content + rename sweep
